#include <stdio.h>

int	main(void)
{
	char s[4];

	scanf("%s",s);
	// printf("%s\n",s);
	// printf("%c %c %c\n",s[0],s[1],s[2]);
	if(('x' == s[0]) && ('x' == s[1]) && ('x' == s[2])){					//トッピングなし
		printf("700\n");
	} else if(('x' != s[0]) && ('x' != s[1]) && ('x' != s[2])){				//全トッピング
		printf("1000\n");
	} else if((('x' == s[0]) && ('x' != s[1]) && ('x' != s[2])) ||
				(('x' != s[0]) && ('x' == s[1]) && ('x' != s[2])) ||
					(('x' != s[0]) && ('x' != s[1]) && ('x' == s[2]))){		//2トッピング
		printf("900\n");
	} else if((('x' == s[0]) && ('x' == s[1]) && ('x' != s[2])) ||
				(('x' != s[0]) && ('x' == s[1]) && ('x' == s[2])) ||
					(('x' == s[0]) && ('x' != s[1]) && ('x' == s[2]))){		//1トッピング
		printf("800\n");
	}
	return (0);
}
