#include <stdio.h>

int	main(void)
{
	int s;

	scanf("%d", &s);
	// printf("%d\n",s);

	int s100 = s / 100;
	int s10 = (s / 10) % 10;
	int s1 = s % 10;
	// printf("百の位は%d\n十の位は%d\n一の位は%d\n", s100,s10,s1);

	if((s100 == 1) && (s10 == 1) && (s1 == 1)){
		printf("3\n");
	} else if(((s100 == 1) && (s10 == 1) && (s1 != 1)) ||
				((s100 == 1) && (s10 != 1) && (s1 == 1)) ||
					((s100 != 1) && (s10 == 1) && (s1 == 1))){
		printf("2\n");
	} else if(((s100 == 1) && (s10 != 1) && (s1 != 1)) ||
				((s100 != 1) && (s10 != 1) && (s1 == 1)) ||
					((s100 != 1) && (s10 == 1) && (s1 != 1))){
		printf("1\n");
	} else if((s100 != 1) && (s10 != 1) && (s1 != 1)){
		printf("0\n");
	}

	return (0);
}
